cmsis-svd/cmsis-svd/data/GigaDevice/GD32F30x_CL.svd
      </registers>
    </peripheral>
   <peripheral>
      <name>ENET_MAC_FCTH</name>
      <description>MAC flow control threshold register </description>
      <groupName>ENET</groupName>
      <baseAddress>0x40029080</baseAddress>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>MAC_FCTH</name>
          <displayName>MAC_FCTH</displayName>
          <description>Ethernet MAC flow control threshold register</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000015</resetValue>
          <fields>
            <field>
              <name>RFA</name>
              <description>Threshold of active flow control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
             <field>
              <name>RFD</name>
              <description>Threshold of deactive flow control</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
       </registers>
    </peripheral>
    <peripheral>
      <name>ENET_MAC</name>
      <description>Ethernet: media access control</description>
      <groupName>ENET</groupName>
      <baseAddress>0x40028000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ENET</name>
        <value>61</value>
      </interrupt>
      <interrupt>
        <name>ENET_WKUP</name>
        <value>62</value>
      </interrupt>
      <registers>
        <register>
          <name>MAC_CFG</name>
          <displayName>MAC_CFG</displayName>
          <description>Ethernet MAC configuration register
          (MAC_CFG)</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00008000</resetValue>
          <fields>
            <field>
              <name>REN</name>
              <description>Receiver enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TEN</name>
              <description>Transmitter enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFC</name>
              <description>Deferral check</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOL</name>
              <description>Back-off limit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>APCD</name>
              <description>Automatic pad/CRC
              drop</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTD</name>
              <description>Retry disable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IPFCO</name>
              <description>IP frame checksum offload</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DPM</name>
              <description>Duplex mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LBM</name>
              <description>Loopback mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ROD</name>
              <description>Receive own disable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPD</name>
              <description>Fast Ethernet speed</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSD</name>
              <description>Carrier sense disable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IGBS</name>
              <description>Inter frame gap bit selection</description>
              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>JBD</name>
              <description>Jabber disable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WDD</name>
              <description>Watchdog disable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
           <field>
              <name>TFCD</name>
              <description>Type Frame CRC Dropping</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MAC_FRMF</name>
          <displayName>MAC_FRMF</displayName>
          <description>Ethernet MAC frame filter register
          (MAC_FRMF)</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PM</name>
              <description>Promiscuous mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HUF</name>
              <description>Hash unicast filter</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HMF</name>
              <description>Hash multicast filter</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DAIFLT</name>
              <description>Destination address inverse filtering</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MFD</name>
              <description> multicast filter disable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BFRMD</name>
              <description>Broadcast frames disable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCFRM</name>
              <description>Pass control frames</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SAIFLT</name>
              <description>Source address inverse
              filtering</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SAFLT</name>
              <description>Source address filter</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HPFLT</name>
              <description>Hash or perfect filter</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FAR</name>
              <description>Frames all receive</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MAC_HLH</name>
          <displayName>MAC_HLH</displayName>
          <description>Ethernet MAC hash list high
          register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HLH</name>
              <description>Hash list high</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MAC_HLL</name>
          <displayName>MAC_HLL</displayName>
          <description>Ethernet MAC hash list low
          register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HLL</name>
              <description>Hash list low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MAC_PHY_CTL</name>
          <displayName>MAC_PHY_CTL</displayName>
          <description>Ethernet MAC PHY control register
          (MAC_PHY_CTL)</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PB</name>
              <description>PHY busy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PW</name>
              <description>PHY write</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLR</name>
              <description>Clock range</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>PR</name>
              <description>PHY register</description>
              <bitOffset>6</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PA</name>
              <description>PHY address</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MAC_PHY_DATA</name>
          <displayName>MAC_PHY_DATA</displayName>
          <description>Ethernet MAC MII data register
          (MAC_PHY_DATA)</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PD</name>
              <description>PHY data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MAC_FCTL</name>
          <displayName>MAC_FCTL</displayName>
          <description>Ethernet MAC flow control register
          (MAC_FCTL)</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FLCB_BKPA</name>
              <description>Flow control busy/back pressure
              activate</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TFCEN</name>
              <description>Transmit flow control
              enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RFCEN</name>
              <description>Receive flow control
              enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UPFDT</name>
              <description>Unicast pause frame detect</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLTS</name>
              <description>Pause low threshold</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DZQP</name>
              <description>Disable Zero-quanta pause</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PTM</name>
              <description>Pause time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MAC_VLT</name>
          <displayName>MAC_VLT</displayName>
          <description>Ethernet MAC VLAN tag register
          (MAC_VLT)</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VLTI</name>
              <description>VLAN tag identifier (for receive
              frames)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>VLTC</name>
              <description>12-bit VLAN tag comparison</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MAC_RWFF</name>
          <displayName>MAC_RWFF</displayName>
          <description>Ethernet MAC remote wakeup frame filter
          register (MAC_RWFF)</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>MAC_WUM</name>
          <displayName>MAC_WUM</displayName>
          <description>Ethernet MAC wakeup management register
          (MAC_WUM)</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PWD</name>
              <description>Power down</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MPEN</name>
              <description>Magic Packet enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WFEN</name>
              <description>Wakeup frame enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MPKR</name>
              <description>Magic packet received</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WUFR</name>
              <description>Wakeup frame received</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GU</name>
              <description>Global unicast</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WUFFRPR</name>
              <description>Wakeup frame filter register pointer
              reset</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MAC_DBG</name>
          <displayName>MAC_DBG</displayName>
          <description>Ethernet MAC debug register
          (MAC_DBG)</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MRNI</name>
              <description>MAC receive state not idle</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXAFS</name>
              <description>Rx asynchronous FIFO status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RXFW</name>
              <description>RxFIFO is writing</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFRS</name>
              <description>RxFIFO read operation status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RXFS</name>
              <description>RxFIFO state</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>

             <field>
              <name>MTNI</name>
              <description>MAC transmit state not idle</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SOMT</name>
              <description>Status of MAC transmitter</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS</name>
              <description>Pause condition status</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXFRS</name>
              <description>TxFIFO read operation status</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TXFW</name>
              <description>TxFIFO is writing</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXFNE</name>
              <description>TxFIFO not empty flag</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXFF</name>
              <description>TxFIFO Full flag</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MAC_INTF</name>
          <displayName>MAC_INTF</displayName>
          <description>Ethernet MAC interrupt flag register
          (MAC_INTF)</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WUM</name>
              <description>WUM status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSC</name>
              <description>MSC status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSCR</name>
              <description>MSC receive status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSCT</name>
              <description>MSC transmit status</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TMST</name>
              <description>Time stamp trigger status</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MAC_INTMSK</name>
          <displayName>MAC_INTMSK</displayName>
          <description>Ethernet MAC interrupt mask register
          (MAC_INTMSK)</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WUMIM</name>
              <description>WUM interrupt mask</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TMSTIM</name>
              <description>Time stamp trigger interrupt
              mask</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MAC_ADDR0H</name>
          <displayName>MAC_ADDR0H</displayName>
          <description>Ethernet MAC address 0 high register
          (MAC_ADDR0H)</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <resetValue>0x8000FFFF</resetValue>
          <fields>
            <field>
              <name>ADDR0H</name>
              <description>MAC  address0 high</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MO</name>
              <description>Always 1</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
