cmsis-svd/cmsis-svd/data/GigaDevice/GD32F30x_CL.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="USART0">
      <name>USART1</name>
      <baseAddress>0x40004400</baseAddress>
      <interrupt>
        <name>USART1</name>    
        <value>38</value>
      </interrupt>
    </peripheral>
   <peripheral derivedFrom="USART0">
      <name>USART2</name>
      <baseAddress>0x40004800</baseAddress>
      <interrupt>
        <name>USART2</name>    
        <value>39</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>UART3</name>
      <description>Universal  asynchronous receiver
      transmitter</description>
      <groupName>UART</groupName>
      <baseAddress>0x40004C00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>UART3</name>       
        <value>52</value>
      </interrupt>
      <registers>
      <register>
          <name>STAT0</name>
          <displayName>STAT0</displayName>
          <description>Status register 0</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <resetValue>0x000000C0</resetValue>
          <fields>
            <field>
              <name>LBDF</name>
              <description>LIN break detection flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            <access>read-write</access>
            </field>
            <field>
              <name>TBE</name>
              <description>Transmit data buffer empty</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            <access>read-only</access>
            </field>
            <field>
              <name>TC</name>
              <description>Transmission complete</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            <access>read-write</access>
            </field>
            <field>
              <name>RBNE</name>
              <description>Read data buffer not empty</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <access>read-write</access>
            </field>
            <field>
              <name>IDLEF</name>
              <description>IDLE frame detected flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <access>read-only</access>
            </field>
            <field>
              <name>ORERR</name>
              <description>Overrun error</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <access>read-only</access>
            </field>
            <field>
              <name>NERR</name>
              <description>Noise error flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <access>read-only</access>
            </field>
            <field>
              <name>FERR</name>
              <description>Frame error flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <access>read-only</access>
            </field>
            <field>
              <name>PERR</name>
              <description>Parity error flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <access>read-only</access>
            </field>
          </fields>
        </register>
       <register>
          <name>DATA</name>
          <displayName>DATA</displayName>
          <description>Data register</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <description>Transmit or read data value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BAUD</name>
          <displayName>BAUD</displayName>
          <description>Baud rate register</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTDIV</name>
              <description>Integer part of baud-rate divider</description>
              <bitOffset>4</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>FRADIV</name>
              <description>Fraction part of baud-rate divider</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTL0</name>
          <displayName>CTL0</displayName>
          <description>Control register 0</description>
          <addressOffset>0x0C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>UEN</name>
              <description>USART enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WL</name>
              <description>Word length</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WM</name>
              <description>Wakeup method in mute mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCEN</name>
              <description>Parity check function enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PM</name>
              <description>Parity mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PERRIE</name>
              <description>Parity error interrupt enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TBEIE</name>
              <description>Transmitter buffer empty interrupt enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCIE</name>
              <description>Transmission complete interrupt enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RBNEIE</name>
              <description>Read data buffer not empty interrupt and overrun error interrupt enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IDLEIE</name>
              <description>IDLE line detected interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TEN</name>
              <description>Transmitter enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>REN</name>
              <description>Receiver enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RWU</name>
              <description>Receiver wakeup from mute mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SBKCMD</name>
              <description>Send break command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTL1</name>
          <displayName>CTL1</displayName>
          <description>Control register 1</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
            <fields>
            <field>
              <name>LMEN</name>
              <description>LIN mode enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LBDIE</name>
              <description>LIN break detection interrupt
              enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LBLEN</name>
              <description>LIN break frame length</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADDR</name>
              <description>Address of the USART</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTL2</name>
          <displayName>CTL2</displayName>
          <description>Control register 2</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields> 
            <field>
              <name>DENT</name>
              <description>DMA request enable for transmission</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DENR</name>
              <description>DMA request enable for reception</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HDEN</name>
              <description>Half-duplex selection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRLP</name>
              <description>IrDA low-power</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IREN</name>
              <description>IrDA mode enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERRIE</name>
              <description>Error interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GP</name>
          <displayName>GP</displayName>
          <description>Guard time and prescaler
          register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PSC</name>
              <description>Prescaler value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
